```terraform
[command]/home/runner/work/_temp/e300d1c5-48f1-4ed9-8bba-8586f18ceaab/terraform-bin plan -no-color
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-GYOR443UBESUZTRGWL3ZLLFNWE]
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.vpc.data.aws_subnet.private_1[0]: Reading...
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.vpc.data.aws_subnet.public_2[0]: Reading...
module.vpc.data.aws_security_group.ec2_public[0]: Reading...
module.vpc.data.aws_subnet.public_1[0]: Reading...
module.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]
module.vpc.data.aws_security_group.rds[0]: Reading...
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.vpc.data.aws_security_group.rds_postgres[0]: Reading...
module.vpc.data.aws_subnet.private_2[0]: Reading...
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]
module.vpc.data.aws_vpc.default: Reading...
module.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.vpc.data.aws_security_group.rds_postgres[0]: Read complete after 0s [id=sg-0fd6a398ff6eaa706]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.vpc.data.aws_security_group.rds[0]: Read complete after 0s [id=sg-0aee8787a289bfd4d]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.apigateway.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-l6xivppfkg-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.apigateway.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-l6xivppfkg-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.apigateway.aws_api_gateway_gateway_response.unauthorized_response will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "unauthorized_response" {
        id                  = "aggr-l6xivppfkg-UNAUTHORIZED"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
      - status_code         = "401" -> null
        # (3 unchanged attributes hidden)
    }

  # module.dynamodb.aws_dynamodb_table.criterion will be updated in-place
  ~ resource "aws_dynamodb_table" "criterion" {
        id                          = "staging-Criterion"
        name                        = "staging-Criterion"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - global_secondary_index {
          - hash_key           = "checklist_id" -> null
          - name               = "ChecklistIdIndex" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      + global_secondary_index {
          + hash_key           = "checklist_id"
          + name               = "ChecklistIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = 10
          + write_capacity     = 10
        }

        # (4 unchanged blocks hidden)
    }

  # module.rds.aws_db_instance.secure[0] will be destroyed
  # (because aws_db_instance.secure is not in configuration)
  - resource "aws_db_instance" "secure" {
      - address                               = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 20 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-east-1:791901361445:db:staging" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1a" -> null
      - backup_retention_period               = 0 -> null
      - backup_target                         = "region" -> null
      - backup_window                         = "08:12-08:42" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - db_name                               = "staging" -> null
      - db_subnet_group_name                  = "staging" -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "14" -> null
      - engine_version_actual                 = "14.9" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "db-GYOR443UBESUZTRGWL3ZLLFNWE" -> null
      - identifier                            = "staging" -> null
      - instance_class                        = "db.t3.micro" -> null
      - iops                                  = 0 -> null
      - license_model                         = "postgresql-license" -> null
      - listener_endpoint                     = [] -> null
      - maintenance_window                    = "tue:05:32-tue:06:02" -> null
      - master_user_secret                    = [] -> null
      - max_allocated_storage                 = 0 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = false -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:postgres-14" -> null
      - parameter_group_name                  = "default.postgres14" -> null
      - password                              = (sensitive value) -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-GYOR443UBESUZTRGWL3ZLLFNWE" -> null
      - skip_final_snapshot                   = true -> null
      - status                                = "available" -> null
      - storage_encrypted                     = false -> null
      - storage_throughput                    = 0 -> null
      - storage_type                          = "gp2" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - username                              = "postgres" -> null
      - vpc_security_group_ids                = [
          - "sg-0fd6a398ff6eaa706",
        ] -> null
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "staging"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "staging"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres14"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0aee8787a289bfd4d",
        ]
    }

  # module.rds.aws_db_subnet_group.secure[0] will be destroyed
  # (because aws_db_subnet_group.secure is not in configuration)
  - resource "aws_db_subnet_group" "secure" {
      - arn                     = "arn:aws:rds:us-east-1:791901361445:subgrp:staging" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "staging" -> null
      - name                    = "staging" -> null
      - subnet_ids              = [
          - "subnet-018110fcdfaa13ea2",
          - "subnet-06383153ba9f3fde3",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - vpc_id                  = "vpc-01c5f678c56d122c2" -> null
    }

  # module.rds.aws_ssm_parameter.db_instance_endpoint will be updated in-place
  # (moved from module.rds.aws_ssm_parameter.db_instance_endpoint[0])
  ~ resource "aws_ssm_parameter" "db_instance_endpoint" {
        id             = "/terraform/staging/rds/endpoint"
      + insecure_value = (known after apply)
        name           = "/terraform/staging/rds/endpoint"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.rds.aws_ssm_parameter.db_instance_name[0] has moved to module.rds.aws_ssm_parameter.db_instance_name
    resource "aws_ssm_parameter" "db_instance_name" {
        id        = "/terraform/staging/rds/db_name"
        name      = "/terraform/staging/rds/db_name"
        tags      = {}
        # (7 unchanged attributes hidden)
    }

  # module.rds.aws_ssm_parameter.db_instance_port will be updated in-place
  # (moved from module.rds.aws_ssm_parameter.db_instance_port[0])
  ~ resource "aws_ssm_parameter" "db_instance_port" {
        id             = "/terraform/staging/rds/port"
      + insecure_value = (known after apply)
        name           = "/terraform/staging/rds/port"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 2 to destroy.

Error: Invalid index

  on ../shared/modules/vpc/route_table.tf line 3, in resource "aws_route_table" "public":
   3:   vpc_id = aws_vpc.main[0].id
    ├────────────────
    │ aws_vpc.main is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.

Error: Invalid index

  on ../shared/modules/vpc/route_table.tf line 7, in resource "aws_route_table" "public":
   7:     gateway_id = aws_internet_gateway.main[0].id
    ├────────────────
    │ aws_internet_gateway.main is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.

Error: Invalid index

  on ../shared/modules/vpc/route_table.tf line 27, in resource "aws_route_table" "private":
  27:   vpc_id = aws_vpc.main[0].id
    ├────────────────
    │ aws_vpc.main is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.
::debug::Terraform exited with code 1.
::debug::stdout: module.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-GYOR443UBESUZTRGWL3ZLLFNWE]%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.data.aws_security_group.rds[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Read complete after 0s [id=sg-0fd6a398ff6eaa706]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.vpc.data.aws_security_group.rds[0]: Read complete after 0s [id=sg-0aee8787a289bfd4d]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_4xx will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {%0A        id                  = "aggr-l6xivppfkg-DEFAULT_4XX"%0A      ~ response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_5xx will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {%0A        id                  = "aggr-l6xivppfkg-DEFAULT_5XX"%0A      ~ response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.unauthorized_response will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "unauthorized_response" {%0A        id                  = "aggr-l6xivppfkg-UNAUTHORIZED"%0A      ~ response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}" -> null%0A        }%0A      - status_code         = "401" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.dynamodb.aws_dynamodb_table.criterion will be updated in-place%0A  ~ resource "aws_dynamodb_table" "criterion" {%0A        id                          = "staging-Criterion"%0A        name                        = "staging-Criterion"%0A        tags                        = {}%0A        # (9 unchanged attributes hidden)%0A%0A      - global_secondary_index {%0A          - hash_key           = "checklist_id" -> null%0A          - name               = "ChecklistIdIndex" -> null%0A          - non_key_attributes = [] -> null%0A          - projection_type    = "ALL" -> null%0A          - read_capacity      = 0 -> null%0A          - write_capacity     = 0 -> null%0A        }%0A      + global_secondary_index {%0A          + hash_key           = "checklist_id"%0A          + name               = "ChecklistIdIndex"%0A          + non_key_attributes = []%0A          + projection_type    = "ALL"%0A          + read_capacity      = 10%0A          + write_capacity     = 10%0A        }%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.rds.aws_db_instance.secure[0] will be destroyed%0A  # (because aws_db_instance.secure is not in configuration)%0A  - resource "aws_db_instance" "secure" {%0A      - address                               = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com" -> null%0A      - allocated_storage                     = 20 -> null%0A      - apply_immediately                     = false -> null%0A      - arn                                   = "arn:aws:rds:us-east-1:791901361445:db:staging" -> null%0A      - auto_minor_version_upgrade            = true -> null%0A      - availability_zone                     = "us-east-1a" -> null%0A      - backup_retention_period               = 0 -> null%0A      - backup_target                         = "region" -> null%0A      - backup_window                         = "08:12-08:42" -> null%0A      - ca_cert_identifier                    = "rds-ca-2019" -> null%0A      - copy_tags_to_snapshot                 = false -> null%0A      - customer_owned_ip_enabled             = false -> null%0A      - db_name                               = "staging" -> null%0A      - db_subnet_group_name                  = "staging" -> null%0A      - delete_automated_backups              = true -> null%0A      - deletion_protection                   = false -> null%0A      - enabled_cloudwatch_logs_exports       = [] -> null%0A      - endpoint                              = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com:5432" -> null%0A      - engine                                = "postgres" -> null%0A      - engine_version                        = "14" -> null%0A      - engine_version_actual                 = "14.9" -> null%0A      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null%0A      - iam_database_authentication_enabled   = false -> null%0A      - id                                    = "db-GYOR443UBESUZTRGWL3ZLLFNWE" -> null%0A      - identifier                            = "staging" -> null%0A      - instance_class                        = "db.t3.micro" -> null%0A      - iops                                  = 0 -> null%0A      - license_model                         = "postgresql-license" -> null%0A      - listener_endpoint                     = [] -> null%0A      - maintenance_window                    = "tue:05:32-tue:06:02" -> null%0A      - master_user_secret                    = [] -> null%0A      - max_allocated_storage                 = 0 -> null%0A      - monitoring_interval                   = 0 -> null%0A      - multi_az                              = false -> null%0A      - network_type                          = "IPV4" -> null%0A      - option_group_name                     = "default:postgres-14" -> null%0A      - parameter_group_name                  = "default.postgres14" -> null%0A      - password                              = (sensitive value) -> null%0A      - performance_insights_enabled          = false -> null%0A      - performance_insights_retention_period = 0 -> null%0A      - port                                  = 5432 -> null%0A      - publicly_accessible                   = false -> null%0A      - replicas                              = [] -> null%0A      - resource_id                           = "db-GYOR443UBESUZTRGWL3ZLLFNWE" -> null%0A      - skip_final_snapshot                   = true -> null%0A      - status                                = "available" -> null%0A      - storage_encrypted                     = false -> null%0A      - storage_throughput                    = 0 -> null%0A      - storage_type                          = "gp2" -> null%0A      - tags                                  = {} -> null%0A      - tags_all                              = {} -> null%0A      - username                              = "postgres" -> null%0A      - vpc_security_group_ids                = [%0A          - "sg-0fd6a398ff6eaa706",%0A        ] -> null%0A    }%0A%0A  # module.rds.aws_db_instance.this will be created%0A  + resource "aws_db_instance" "this" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "staging"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "14"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "staging"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "default.postgres14"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = true%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = "gp2"%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "postgres"%0A      + vpc_security_group_ids                = [%0A          + "sg-0aee8787a289bfd4d",%0A        ]%0A    }%0A%0A  # module.rds.aws_db_subnet_group.secure[0] will be destroyed%0A  # (because aws_db_subnet_group.secure is not in configuration)%0A  - resource "aws_db_subnet_group" "secure" {%0A      - arn                     = "arn:aws:rds:us-east-1:791901361445:subgrp:staging" -> null%0A      - description             = "Managed by Terraform" -> null%0A      - id                      = "staging" -> null%0A      - name                    = "staging" -> null%0A      - subnet_ids              = [%0A          - "subnet-018110fcdfaa13ea2",%0A          - "subnet-06383153ba9f3fde3",%0A        ] -> null%0A      - supported_network_types = [%0A          - "IPV4",%0A        ] -> null%0A      - tags                    = {} -> null%0A      - tags_all                = {} -> null%0A      - vpc_id                  = "vpc-01c5f678c56d122c2" -> null%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_endpoint will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_endpoint[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_endpoint" {%0A        id             = "/terraform/staging/rds/endpoint"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/endpoint"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_name[0] has moved to module.rds.aws_ssm_parameter.db_instance_name%0A    resource "aws_ssm_parameter" "db_instance_name" {%0A        id        = "/terraform/staging/rds/db_name"%0A        name      = "/terraform/staging/rds/db_name"%0A        tags      = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_port will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_port[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_port" {%0A        id             = "/terraform/staging/rds/port"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/port"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 6 to change, 2 to destroy.%0A
::debug::stderr: %0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 3, in resource "aws_route_table" "public":%0A   3:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 7, in resource "aws_route_table" "public":%0A   7:     gateway_id = aws_internet_gateway.main[0].id%0A    ├────────────────%0A    │ aws_internet_gateway.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 27, in resource "aws_route_table" "private":%0A  27:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A
::debug::exitcode: 1

::set-output name=stdout::module.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-GYOR443UBESUZTRGWL3ZLLFNWE]%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.data.aws_security_group.rds[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Read complete after 0s [id=sg-0fd6a398ff6eaa706]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.vpc.data.aws_security_group.rds[0]: Read complete after 0s [id=sg-0aee8787a289bfd4d]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_4xx will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {%0A        id                  = "aggr-l6xivppfkg-DEFAULT_4XX"%0A      ~ response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_5xx will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {%0A        id                  = "aggr-l6xivppfkg-DEFAULT_5XX"%0A      ~ response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.unauthorized_response will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "unauthorized_response" {%0A        id                  = "aggr-l6xivppfkg-UNAUTHORIZED"%0A      ~ response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}" -> null%0A        }%0A      - status_code         = "401" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.dynamodb.aws_dynamodb_table.criterion will be updated in-place%0A  ~ resource "aws_dynamodb_table" "criterion" {%0A        id                          = "staging-Criterion"%0A        name                        = "staging-Criterion"%0A        tags                        = {}%0A        # (9 unchanged attributes hidden)%0A%0A      - global_secondary_index {%0A          - hash_key           = "checklist_id" -> null%0A          - name               = "ChecklistIdIndex" -> null%0A          - non_key_attributes = [] -> null%0A          - projection_type    = "ALL" -> null%0A          - read_capacity      = 0 -> null%0A          - write_capacity     = 0 -> null%0A        }%0A      + global_secondary_index {%0A          + hash_key           = "checklist_id"%0A          + name               = "ChecklistIdIndex"%0A          + non_key_attributes = []%0A          + projection_type    = "ALL"%0A          + read_capacity      = 10%0A          + write_capacity     = 10%0A        }%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.rds.aws_db_instance.secure[0] will be destroyed%0A  # (because aws_db_instance.secure is not in configuration)%0A  - resource "aws_db_instance" "secure" {%0A      - address                               = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com" -> null%0A      - allocated_storage                     = 20 -> null%0A      - apply_immediately                     = false -> null%0A      - arn                                   = "arn:aws:rds:us-east-1:791901361445:db:staging" -> null%0A      - auto_minor_version_upgrade            = true -> null%0A      - availability_zone                     = "us-east-1a" -> null%0A      - backup_retention_period               = 0 -> null%0A      - backup_target                         = "region" -> null%0A      - backup_window                         = "08:12-08:42" -> null%0A      - ca_cert_identifier                    = "rds-ca-2019" -> null%0A      - copy_tags_to_snapshot                 = false -> null%0A      - customer_owned_ip_enabled             = false -> null%0A      - db_name                               = "staging" -> null%0A      - db_subnet_group_name                  = "staging" -> null%0A      - delete_automated_backups              = true -> null%0A      - deletion_protection                   = false -> null%0A      - enabled_cloudwatch_logs_exports       = [] -> null%0A      - endpoint                              = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com:5432" -> null%0A      - engine                                = "postgres" -> null%0A      - engine_version                        = "14" -> null%0A      - engine_version_actual                 = "14.9" -> null%0A      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null%0A      - iam_database_authentication_enabled   = false -> null%0A      - id                                    = "db-GYOR443UBESUZTRGWL3ZLLFNWE" -> null%0A      - identifier                            = "staging" -> null%0A      - instance_class                        = "db.t3.micro" -> null%0A      - iops                                  = 0 -> null%0A      - license_model                         = "postgresql-license" -> null%0A      - listener_endpoint                     = [] -> null%0A      - maintenance_window                    = "tue:05:32-tue:06:02" -> null%0A      - master_user_secret                    = [] -> null%0A      - max_allocated_storage                 = 0 -> null%0A      - monitoring_interval                   = 0 -> null%0A      - multi_az                              = false -> null%0A      - network_type                          = "IPV4" -> null%0A      - option_group_name                     = "default:postgres-14" -> null%0A      - parameter_group_name                  = "default.postgres14" -> null%0A      - password                              = (sensitive value) -> null%0A      - performance_insights_enabled          = false -> null%0A      - performance_insights_retention_period = 0 -> null%0A      - port                                  = 5432 -> null%0A      - publicly_accessible                   = false -> null%0A      - replicas                              = [] -> null%0A      - resource_id                           = "db-GYOR443UBESUZTRGWL3ZLLFNWE" -> null%0A      - skip_final_snapshot                   = true -> null%0A      - status                                = "available" -> null%0A      - storage_encrypted                     = false -> null%0A      - storage_throughput                    = 0 -> null%0A      - storage_type                          = "gp2" -> null%0A      - tags                                  = {} -> null%0A      - tags_all                              = {} -> null%0A      - username                              = "postgres" -> null%0A      - vpc_security_group_ids                = [%0A          - "sg-0fd6a398ff6eaa706",%0A        ] -> null%0A    }%0A%0A  # module.rds.aws_db_instance.this will be created%0A  + resource "aws_db_instance" "this" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "staging"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "14"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "staging"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "default.postgres14"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = true%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = "gp2"%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "postgres"%0A      + vpc_security_group_ids                = [%0A          + "sg-0aee8787a289bfd4d",%0A        ]%0A    }%0A%0A  # module.rds.aws_db_subnet_group.secure[0] will be destroyed%0A  # (because aws_db_subnet_group.secure is not in configuration)%0A  - resource "aws_db_subnet_group" "secure" {%0A      - arn                     = "arn:aws:rds:us-east-1:791901361445:subgrp:staging" -> null%0A      - description             = "Managed by Terraform" -> null%0A      - id                      = "staging" -> null%0A      - name                    = "staging" -> null%0A      - subnet_ids              = [%0A          - "subnet-018110fcdfaa13ea2",%0A          - "subnet-06383153ba9f3fde3",%0A        ] -> null%0A      - supported_network_types = [%0A          - "IPV4",%0A        ] -> null%0A      - tags                    = {} -> null%0A      - tags_all                = {} -> null%0A      - vpc_id                  = "vpc-01c5f678c56d122c2" -> null%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_endpoint will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_endpoint[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_endpoint" {%0A        id             = "/terraform/staging/rds/endpoint"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/endpoint"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_name[0] has moved to module.rds.aws_ssm_parameter.db_instance_name%0A    resource "aws_ssm_parameter" "db_instance_name" {%0A        id        = "/terraform/staging/rds/db_name"%0A        name      = "/terraform/staging/rds/db_name"%0A        tags      = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_port will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_port[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_port" {%0A        id             = "/terraform/staging/rds/port"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/port"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 6 to change, 2 to destroy.%0A

::set-output name=stderr::%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 3, in resource "aws_route_table" "public":%0A   3:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 7, in resource "aws_route_table" "public":%0A   7:     gateway_id = aws_internet_gateway.main[0].id%0A    ├────────────────%0A    │ aws_internet_gateway.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 27, in resource "aws_route_table" "private":%0A  27:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A

::set-output name=exitcode::1
::error::Terraform exited with code 1.

```